src/bsl/Documents/гкс_ЛабораторныйАнализ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>гкс_ЛабораторныйАнализ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.гкс_ФактическиеПоказателиКачества</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидЛабораторногоАнализа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ВидыЛабораторногоАнализа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоОбразцов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВнешний</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПробы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_СтатусыЛабораторногоАнализа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>гкс_ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_РегистрацияНаПЛК</v8:Type>
						<v8:Type>cfg:DocumentRef.гкс_ФормированиеНомераПробы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>гкс_МестнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>гкс_НазначениеИспользованияКачества</Name>
					<Comment>ERP-2184</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_НазначенияИспользованияКачества</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>гкс_ВидПеревозки</Name>
					<Comment>ERP-2184</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыТранспортныхСредствДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>гкс_ДатаПолученияАнализа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>гкс_ДатаНачалаАнализа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>гкс_ДатаОкончанияАнализа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>гкс_СостояниеТранспортногоСредства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_СостоянияТранспортныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодУрожая</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормативнаяСертификация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_НормативнаяСертификацияНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяПроба</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_ВнешняяПроба</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяСуммаВнешнейПробы</Name>
					<Comment>Контрольная сумма MD5</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КачественныеПоказатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.гкс_ПоказателиАнализовНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СоответствуетНормативу</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтклонениеОтБазиса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПробы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>гкс_Примечание</Name>
							<Comment>ERP-1475</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомментарийСоотвествия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УсиленныйКонтроль</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтклонятьКачество</Name>
							<Comment>При отклонении от нормы - отклонять качество</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоЗначениеВнешнейПробы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_НастройкиПечатиФормированияПроб.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_НастройкиПечатиФормированияПроб</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоЭтикеток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемПробы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ГОСТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Comment>ERP-1220</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипПробы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыПроб</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыТранспортныхСредствДоставки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_РезультатыНормативнойСертификацииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_РезультатыНормативнойСертификацииНоменклатуры</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоказателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Базис</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальноеЗначение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГОСТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтклонятьКачество</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИскатьВнешниеПробы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПоказательАнализа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ПоказателиАнализовНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НазначениеИспользованияКачества</Name>
					<Comment>ERP-2184</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_НазначенияИспользованияКачества</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Comment>ERP-2184</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыТранспортныхСредствДоставки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/Enums/гкс_СтатусыЛабораторногоАнализа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_СтатусыЛабораторногоАнализа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтборПробы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПовторныйАнализ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтмена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/Enums/гкс_ТипыПроб.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_ТипыПроб</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Единичная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Композитная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/Documents/гкс_ЛабораторныйАнализ/Ext/ObjectModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьОбъектЗначениямиПоУмолчанию() Экспорт

	Если НЕ ЗначениеЗаполнено(гкс_МестнаяДата) И ЗначениеЗаполнено(ТочкаМаршрута) Тогда

		ЧасовойПояс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТочкаМаршрута, "гкс_ЧасовойПоясТочкиМаршрута");

		Если ЗначениеЗаполнено(ЧасовойПояс) Тогда
			гкс_МестнаяДата = МестноеВремя(ТекущаяУниверсальнаяДата(), ЧасовойПояс);
		КонецЕсли;

	КонецЕсли;

	Если Не ЗначениеЗаполнено(КоличествоОбразцов) Тогда
		КоличествоОбразцов =
			РегистрыСведений.гкс_НастройкиПечатиФормированияПроб.КоличествоОбразцовПробПоПараметрамОтбора(
				Номенклатура, ТочкаМаршрута, гкс_ВидПеревозки, гкс_НазначениеИспользованияКачества);
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Статус) Тогда
		Статус = Перечисления.гкс_СтатусыЛабораторногоАнализа.ОтборПробы;
	КонецЕсли;

КонецПроцедуры

// Заполняет табличную часть "Качественные показатели" значениями из соотвествия с средневзвешенными показателями
// предварительно табличная часть показателей должна быть заполнена по спецификации композитного анализа.
// показатели не добавленные в спецификацию не учитываются.
//
// Параметры:
//   СредневзвешенныеПоказатели - Соответствие - средневзвешенные значения показателей
//
Процедура ЗаполнитьСредневзвешенныеПоказатели(СредневзвешенныеПоказатели) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("гкс_ИспользоватьСредневзвешенныеПоказатели") Тогда
		Возврат;
	КонецЕсли;

	Для Каждого КлючЗначение Из СредневзвешенныеПоказатели Цикл

		Показатель = КлючЗначение.Ключ;
		НайденнаяСтрока	= КачественныеПоказатели.Найти(Показатель, "Показатель");
		Если НайденнаяСтрока <> Неопределено Тогда
			НайденнаяСтрока.Значение = КлючЗначение.Значение;
		КонецЕсли;

	КонецЦикла;

	ПроверитьСоотвествиеКачеству();

КонецПроцедуры

// Проводит проверку соотвествия фактических значений анализов с нормативными показателями спецификации
// и показателями усиленного контроля
//
Процедура ПроверитьСоотвествиеКачеству(Показатель = Неопределено) Экспорт

	МинимальноеКачествоПриемкиПоставщика = МинимальныеЗначенияКачестваПриемкиПоставщика();
	ДопустимыеИнтервалыНормативнойСпецификации = ДопустимыеИнтервалыНормативнойСпецификации();
	ДопустимыеИнтервалыУсиленногоКонтроля = ДопустимыеИнтервалыУсиленногоКонтроля();

	Если ЗначениеЗаполнено(Показатель) Тогда
		Строка = КачественныеПоказатели.Найти(Показатель, "Показатель");
		ПроверитьСтрокуАнализаСоотвествиюКачеству(Строка, ДопустимыеИнтервалыНормативнойСпецификации,
			ДопустимыеИнтервалыУсиленногоКонтроля, МинимальноеКачествоПриемкиПоставщика);
	Иначе
		Для Каждого Строка Из КачественныеПоказатели Цикл
			ПроверитьСтрокуАнализаСоотвествиюКачеству(Строка, ДопустимыеИнтервалыНормативнойСпецификации,
				ДопустимыеИнтервалыУсиленногоКонтроля, МинимальноеКачествоПриемкиПоставщика);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда

		гкс_ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);

		МассивПоказателей = Неопределено;
		Если ДанныеЗаполнения.Свойство("ПоказателиВнешнихПроб", МассивПоказателей) Тогда
			ЗаполнитьКачественныеПоказателиДанными(МассивПоказателей);
		КонецЕсли;

		Если ДанныеЗаполнения.Свойство("МассивПоказателей", МассивПоказателей) Тогда
			ЗаполнитьКачественныеПоказателиДанными(МассивПоказателей);
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения
	     И Статус = Перечисления.гкс_СтатусыЛабораторногоАнализа.Выполнен
	     И Не Пользователи.ЭтоПолноправныйПользователь() Тогда

		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru='Выполнять отмену проведения документа в статусе ""Выполнен"" разрешено только администратору'"));

	КонецЕсли;

	ЗаполнитьОбъектЗначениямиПоУмолчанию();

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

	гкс_ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);

	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ДополнительныеСвойства.Вставить("СоответствуетНормативу", СоответствуетНормативу());
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	гкс_ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	ДопПараметры = гкс_ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	ИнициализироватьДопПараметры(ДопПараметры);

	// Заполнение РС показателей усиленного контроля
	ЗаполнитьРегистрПоказателейУсиленногоКонтроля();

	гкс_ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ, ДопПараметры);

	// Вспомогательные движения / формирование документов для текущей регистрации
	ЗаполнитьРегистрЗаблокированныеРегистрацииПЛК(Отказ);

	// Вспомоглательные движения/ документы для Заблокированных  регистрацией/ группой ТС данных
	СформироватьВспомогательныеДанныеДляЗаблокированныхТС(Отказ);

	Если ОбновитьНаправлениеНаРазгрузку(Отказ) Тогда
		СформироватьНаправлениеНаРазгрузкуПриНеобходимости(гкс_ДокументРегистрации, Ссылка, Дата, ДопПараметры);
	КонецЕсли;

	ПерезаполнитьОснованиеДвиженияЗапасовПриНеобходимости(Отказ);

	Если ОбновитьДаннымАРМПриемка(ДополнительныеСвойства, Отказ) Тогда
		гкс_ПриемкаТранспортаВызовСервера.
			РассчитатьДанныеРегистрацииДляРМПриемкаТранспорта(гкс_ДокументРегистрации);
	КонецЕсли;


КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	гкс_ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПроверитьСтрокуАнализаСоотвествиюКачеству(Строка, ДопустимыеИнтервалыНормативнойСпецификации,
			ДопустимыеИнтервалыУсиленногоКонтроля, МинимальноеКачествоПриемкиПоставщика);

	Если Строка.УсиленныйКонтроль Тогда
		Если ДопустимыеИнтервалыУсиленногоКонтроля <> Неопределено Тогда
			ДопустимыйИнтервалУК  = ДопустимыеИнтервалыУсиленногоКонтроля.Найти(Строка.Показатель, "Показатель");
		Иначе
			ДопустимыйИнтервалУК = Неопределено;
		КонецЕсли;

		ПроверитьВхождениеВИнтервалКачества(Строка, ДопустимыйИнтервалУК);
	Иначе

		Если Не ПроверкаМинимальногоКачестваПриемкиПоставщика(Строка, МинимальноеКачествоПриемкиПоставщика) Тогда

			Если ДопустимыеИнтервалыНормативнойСпецификации <> Неопределено Тогда
				ДопустимыйИнтервалНорм = ДопустимыеИнтервалыНормативнойСпецификации.Найти(Строка.Показатель, "Показатель");
			Иначе
				ДопустимыйИнтервалНорм = Неопределено;
			КонецЕсли;

			ПроверитьВхождениеВИнтервалКачества(Строка, ДопустимыйИнтервалНорм);
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

Функция ПроверкаМинимальногоКачестваПриемкиПоставщика(СтрокаЛабАнализа, МинимальноеКачествоПриемкиПоставщика)

	Если МинимальноеКачествоПриемкиПоставщика = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	МинимальноеКачествоПриемки = МинимальноеКачествоПриемкиПоставщика.Найти(СтрокаЛабАнализа.Показатель, "Показатель");

	Если МинимальноеКачествоПриемки <> Неопределено И СтрокаЛабАнализа.Значение <> 0 Тогда

		Если СтрокаЛабАнализа.Значение < МинимальноеКачествоПриемки.ЗначениеПоказателя Тогда

			СтрокаЛабАнализа.СоответствуетНормативу = Ложь;
			СтрокаЛабАнализа.ОтклонятьКачество = МинимальноеКачествоПриемки.ОтклонятьКачество;

			СтрокаЛабАнализа.КомментарийСоотвествия = СтрШаблон("%1 (%2)",
				МинимальноеКачествоПриемки.Комментарий,
				МинимальноеКачествоПриемки.ЗначениеПоказателя);
		Иначе
			СтрокаЛабАнализа.СоответствуетНормативу = Истина;
			СтрокаЛабАнализа.КомментарийСоотвествия = "";
		КонецЕсли;

		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;

	Возврат Результат;

КонецФункции

Процедура ПроверитьВхождениеВИнтервалКачества(СтрокаЛабАнализа, ДопустимыйИнтервал)

	Если ДопустимыйИнтервал = Неопределено Тогда
		СтрокаЛабАнализа.СоответствуетНормативу = Ложь;
		СтрокаЛабАнализа.ОтклонятьКачество = Истина;
		СтрокаЛабАнализа.КомментарийСоотвествия = ?(СтрокаЛабАнализа.УсиленныйКонтроль,
			"Не установлены ограничения по усиленному контролю" , "Не установлены нормы на показатель");
	Иначе

		Если СтрокаЛабАнализа.Значение >= ДопустимыйИнтервал.ЗначениеПоказателяМин
			И СтрокаЛабАнализа.Значение <= ДопустимыйИнтервал.ЗначениеПоказателяМакс Тогда
			СтрокаЛабАнализа.СоответствуетНормативу = Истина;
			СтрокаЛабАнализа.ОтклонятьКачество = Ложь;
			СтрокаЛабАнализа.КомментарийСоотвествия = "";
		Иначе
			СтрокаЛабАнализа.СоответствуетНормативу = Ложь;
			СтрокаЛабАнализа.ОтклонятьКачество = ДопустимыйИнтервал.ОтклонятьКачество;
		КонецЕсли;

		СтрокаЛабАнализа.ОтклонениеОтБазиса = СтрокаЛабАнализа.Значение - ДопустимыйИнтервал.Базис;

	КонецЕсли;

КонецПроцедуры

Процедура УстановитьСвойствоПроведенияСостоянияРегистрации() Экспорт

	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;

	НужноОтражатьСостояниеРегистрации = Документы.гкс_РегистрацияНаПЛК
		.ОтражатьСостояниеРегистрацииДляЛабораторногоАнализа(гкс_ДокументРегистрации);

	Если Не НужноОтражатьСостояниеРегистрации Тогда
		ДополнительныеСвойства.Вставить("НеОтражатьСостоянияРегистрации", Истина);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаписатьДокументПослеОбработки() Экспорт

	Если ПометкаУдаления Тогда
		Записать(РежимЗаписиДокумента.Запись);
	Иначе

		Если ЗначениеЗаполнено(гкс_ДатаОкончанияАнализа)
			Или НеОжидатьОкончанияАнализаДляВыполнения() Тогда
			Статус = Перечисления.гкс_СтатусыЛабораторногоАнализа.Выполнен;
		ИначеЕсли ЗначениеЗаполнено(гкс_ДатаНачалаАнализа) Тогда
			Статус = Перечисления.гкс_СтатусыЛабораторногоАнализа.Выполняется;
		КонецЕсли;
		Записать(РежимЗаписиДокумента.Проведение);

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗаполнениеДокумента

// Заполнить список качественных показателей для дальнейшего исследования.
//
Процедура ЗаполнитьПоказателиДляИсследования() Экспорт

	// показания внешних проб не удаляем
	СтрокиКУдалению = КачественныеПоказатели.НайтиСтроки(Новый Структура("ЭтоЗначениеВнешнейПробы", Ложь));
	Для Каждого Строка Из СтрокиКУдалению Цикл
		КачественныеПоказатели.Удалить(Строка);
	КонецЦикла;

	НормативныеПоказатели = гкс_РаботаСПоказателямиНоменклатуры.НормативныеПоказатели(
		ТочкаМаршрута, Номенклатура, гкс_ВидПеревозки, гкс_НазначениеИспользованияКачества, Дата);

	Для Каждого ЭлементМассива Из НормативныеПоказатели Цикл

		СтрокаТабЧасти = КачественныеПоказатели.Найти(ЭлементМассива.Показатель, "Показатель");
		Если СтрокаТабЧасти = Неопределено Тогда
			НоваяСтрока = КачественныеПоказатели.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементМассива, "Показатель, ЕдиницаИзмерения");
			НоваяСтрока.НомерПробы = НомерПробы;
		Иначе
			СтрокаТабЧасти.СоответствуетНормативу = Ложь;
		КонецЕсли;

	КонецЦикла;

	// заполнение показателей усиленного контроля
	Если ЗначениеЗаполнено(гкс_ДокументРегистрации) Тогда

		ПоказателиУсиленногоКонтроля = гкс_РаботаСПоказателямиНоменклатуры.ПоказателиУсиленногоКонтроля(
			гкс_ДокументРегистрации, гкс_НазначениеИспользованияКачества);

		Для Каждого ЭлементМассива Из ПоказателиУсиленногоКонтроля Цикл

			СтрокаТабЧасти = КачественныеПоказатели.Найти(ЭлементМассива.Показатель, "Показатель");
			Если СтрокаТабЧасти = Неопределено Тогда
				СтрокаТабЧасти = КачественныеПоказатели.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТабЧасти, ЭлементМассива, "Показатель, ЕдиницаИзмерения");
				СтрокаТабЧасти.НомерПробы = НомерПробы;
			КонецЕсли;

			СтрокаТабЧасти.УсиленныйКонтроль = Истина;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьКачественныеПоказателиДанными(МассивПоказателей)

	Для Каждого ЭлементМассива Из МассивПоказателей Цикл

		СтрокаТабЧасти = КачественныеПоказатели.Найти(ЭлементМассива.Показатель, "Показатель");

		Если СтрокаТабЧасти	= Неопределено Тогда
			НоваяСтрока = КачественныеПоказатели.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементМассива);

			Если Не НоваяСтрока.ЭтоЗначениеВнешнейПробы Тогда
				НоваяСтрока.НомерПробы = НомерПробы;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область НормативнаяСертификацияИКачественныеПоказатели

Функция ДопустимыеИнтервалыНормативнойСпецификации()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НормативныеЗначения.ПоказательАнализа КАК Показатель,
		|	МАКСИМУМ(НормативныеЗначения.ЗначениеПоказателя) КАК ЗначениеПоказателяМин,
		|	МАКСИМУМ(НормативныеЗначения.МаксимальноеЗначение) КАК ЗначениеПоказателяМакс,
		|	МАКСИМУМ(НормативныеЗначения.Базис) КАК Базис,
		|	НормативныеЗначения.ОтклонятьКачество КАК ОтклонятьКачество
		|ПОМЕСТИТЬ ВТ_НормативныеЗначенияДляНоменклатуры
		|ИЗ
		|	РегистрСведений.гкс_РезультатыНормативнойСертификацииНоменклатуры.СрезПоследних(
		|			&ДатаАнализа,
		|			Номенклатура = &Номенклатура
		|				И ТочкаМаршрута = &ТочкаМаршрута
		|				И ВидПеревозки = &ВидПеревозки
		|				И НазначениеИспользованияКачества = &НазначениеИспользования
		|				И (ПериодС <= &ДатаАнализа
		|					ИЛИ ПериодС = ДАТАВРЕМЯ(1, 1, 1))
		|				И (ПериодПо >= НАЧАЛОПЕРИОДА(&ДатаАнализа, ДЕНЬ)
		|					ИЛИ ПериодПо = ДАТАВРЕМЯ(1, 1, 1))) КАК НормативныеЗначения
		|
		|СГРУППИРОВАТЬ ПО
		|	НормативныеЗначения.ПоказательАнализа,
		|	НормативныеЗначения.ОтклонятьКачество
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НормативныеЗначенияДляНоменклатуры.Показатель КАК Показатель,
		|	ЕСТЬNULL(НормативнаяСертификацияСлужебнойНоменклатуры.ЗначениеПоказателя, ВТ_НормативныеЗначенияДляНоменклатуры.ЗначениеПоказателяМин) КАК ЗначениеПоказателяМин,
		|	ЕСТЬNULL(НормативнаяСертификацияСлужебнойНоменклатуры.МаксЗначениеПоказателя, ВТ_НормативныеЗначенияДляНоменклатуры.ЗначениеПоказателяМакс) КАК ЗначениеПоказателяМакс,
		|	ЕСТЬNULL(НормативнаяСертификацияСлужебнойНоменклатуры.Базис, ВТ_НормативныеЗначенияДляНоменклатуры.Базис) КАК Базис,
		|	ЕСТЬNULL(НормативнаяСертификацияСлужебнойНоменклатуры.ОтклонятьКачество, ВТ_НормативныеЗначенияДляНоменклатуры.ОтклонятьКачество) КАК ОтклонятьКачество
		|ИЗ
		|	ВТ_НормативныеЗначенияДляНоменклатуры КАК ВТ_НормативныеЗначенияДляНоменклатуры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.гкс_ПоказателиАнализовНоменклатуры КАК ПоказателиАнализовНоменклатуры
		|		ПО ВТ_НормативныеЗначенияДляНоменклатуры.Показатель = ПоказателиАнализовНоменклатуры.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_НормативнаяСертификацияНоменклатуры.Анализы КАК НормативнаяСертификацияСлужебнойНоменклатуры
		|		ПО (НормативнаяСертификацияСлужебнойНоменклатуры.Ссылка = &СертификацияСлужебнойНоменклатуры)
		|			И ВТ_НормативныеЗначенияДляНоменклатуры.Показатель = НормативнаяСертификацияСлужебнойНоменклатуры.ПоказательАнализа";

	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
   	Запрос.УстановитьПараметр("ТочкаМаршрута", ТочкаМаршрута);
	Запрос.УстановитьПараметр("ВидПеревозки", гкс_ВидПеревозки);
	Запрос.УстановитьПараметр("НазначениеИспользования", гкс_НазначениеИспользованияКачества);
	Запрос.УстановитьПараметр("ДатаАнализа", ДатаАнализа());
	Запрос.УстановитьПараметр("СертификацияСлужебнойНоменклатуры", НормативнаяСертификация);

	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Результат = Неопределено;
	Иначе
		Результат = РезультатЗапроса.Выгрузить();
	КонецЕсли;

	Возврат Результат;

КонецФункции

Функция ДопустимыеИнтервалыУсиленногоКонтроля()

	Результат = Неопределено;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ФормированиеНомераПробыСписокРегистраций.ДокументРегистрации КАК ДокументРегистрации,
		|	ЛабораторныйАнализ.гкс_НазначениеИспользованияКачества КАК НазначениеИспользованияКачества,
		|	ЗНАЧЕНИЕ(Перечисление.гкс_ТипыПроб.Композитная) КАК ТипПробы
		|ПОМЕСТИТЬ ВТ_СписокРегистраций
		|ИЗ
		|	Документ.гкс_ЛабораторныйАнализ КАК ЛабораторныйАнализ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ФормированиеНомераПробы.СписокРегистраций КАК ФормированиеНомераПробыСписокРегистраций
		|		ПО (ЛабораторныйАнализ.Ссылка = &Ссылка)
		|			И (ТИПЗНАЧЕНИЯ(ЛабораторныйАнализ.гкс_ДокументРегистрации) = ТИП(Документ.гкс_ФормированиеНомераПробы))
		|			И ЛабораторныйАнализ.гкс_ДокументРегистрации = ФормированиеНомераПробыСписокРегистраций.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛабораторныйАнализ.гкс_ДокументРегистрации,
		|	ЛабораторныйАнализ.гкс_НазначениеИспользованияКачества,
		|	ЗНАЧЕНИЕ(Перечисление.гкс_ТипыПроб.Единичная)
		|ИЗ
		|	Документ.гкс_ЛабораторныйАнализ КАК ЛабораторныйАнализ
		|ГДЕ
		|	ЛабораторныйАнализ.Ссылка = &Ссылка
		|	И ТИПЗНАЧЕНИЯ(ЛабораторныйАнализ.гкс_ДокументРегистрации) = ТИП(Документ.гкс_РегистрацияНаПЛК)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПоказателиУсиленногоКонтроляПоРегистрации.Показатель КАК Показатель,
		|	ПоказателиУсиленногоКонтроляПоРегистрации.ЗначениеПоказателяМин КАК ЗначениеПоказателяМин,
		|	ПоказателиУсиленногоКонтроляПоРегистрации.ЗначениеПоказателяМакс КАК ЗначениеПоказателяМакс,
		|	ПоказателиУсиленногоКонтроляПоРегистрации.Базис КАК Базис,
		|	ПоказателиУсиленногоКонтроляПоРегистрации.ОтклонятьКачество КАК ОтклонятьКачество
		|ИЗ
		|	РегистрСведений.гкс_ПоказателиУсиленногоКонтроляПоРегистрации КАК ПоказателиУсиленногоКонтроляПоРегистрации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СписокРегистраций КАК ВТ_СписокРегистраций
		|		ПО ПоказателиУсиленногоКонтроляПоРегистрации.ДокументРегистрации = ВТ_СписокРегистраций.ДокументРегистрации
		|			И ПоказателиУсиленногоКонтроляПоРегистрации.НазначениеИспользования = ВТ_СписокРегистраций.НазначениеИспользованияКачества
		|			И ПоказателиУсиленногоКонтроляПоРегистрации.ТипПробы = ВТ_СписокРегистраций.ТипПробы,
		|	Константа.гкс_ИспользоватьУсиленныйКонтрольКачества КАК ИспользоватьУсиленныйКонтрольКачества
		|ГДЕ
		|	ИспользоватьУсиленныйКонтрольКачества.Значение = ИСТИНА";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда
		Результат = РезультатЗапроса.Выгрузить();
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Возвращает значения минимальных разрешенных значений для показателей качества поставщика
//
// Возвращаемое значение:
//   ТаблицаЗначений, Неопределено -
//
Функция МинимальныеЗначенияКачестваПриемкиПоставщика()

	Результат = Неопределено;

	Если Не (ЭтоРегистрацияНаПЛК(гкс_ДокументРегистрации)
		И Перечисления.гкс_НазначенияИспользованияКачества.ЭтоПриемка(гкс_НазначениеИспользованияКачества)) Тогда
		Возврат Результат;
	КонецЕсли;

	Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(гкс_ДокументРегистрации, "ОтправительПолучатель");

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	МинимальныеПоказателиКачестваПриемкиСрезПоследних.Показатель КАК Показатель,
		|	МинимальныеПоказателиКачестваПриемкиСрезПоследних.ЗначениеПоказателя КАК ЗначениеПоказателя,
		|	МинимальныеПоказателиКачестваПриемкиСрезПоследних.ОстатокДляПриемки КАК ОстатокДляПриемки,
		|	МинимальныеПоказателиКачестваПриемкиСрезПоследних.ШаблонКомментария КАК Комментарий,
		|	ЛОЖЬ КАК ОтклонятьКачество
		|ИЗ
		|	РегистрСведений.гкс_МинимальныеПоказателиКачестваПриемки.СрезПоследних(
		|			&Период,
		|			Контрагент = &Контрагент
		|				И Номенклатура = &Номенклатура) КАК МинимальныеПоказателиКачестваПриемкиСрезПоследних";

	Запрос.УстановитьПараметр("Период", ДатаАнализа());
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);

	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Результат = Неопределено;
	Иначе
		Результат = РезультатЗапроса.Выгрузить();
	КонецЕсли;

    Возврат Результат;

КонецФункции

Функция ДатаАнализа()

	Если ЗначениеЗаполнено(гкс_ДатаПолученияАнализа) Тогда
		Результат = гкс_ДатаПолученияАнализа;
	Иначе
		Результат = Дата;
	КонецЕсли;

	Возврат Результат;

КонецФункции

#КонецОбласти

#Область Прочее

// Заполнить регистр показателей усиленного контроля по регистрации.
//
// Процедура выполняет дозаполнение поля ЛабораторныйАнализ в регистре сведений
// гкс_ПоказателиУсиленногоКонтроляПоРегистрации для записей, соответствующих
// показателям из табличной части КачественныеПоказатели при проведении документа.
//
// Логика:
//   1. Читает существующие записи регистра по документу регистрации
//   2. Для записей с показателями из ТЧ и незаполненным полем ЛабораторныйАнализ
//   3. Дозаполняет поле ЛабораторныйАнализ ссылкой на текущий документ
//
Процедура ЗаполнитьРегистрПоказателейУсиленногоКонтроля()

	// Проверяем условие необходимости усиленного контроля
	Если ТребуетсяУсиленныйКонтрольЛабАнализа() Тогда
		гкс_ВходнойКонтрольКачества.ЗаполнитьРегистрПоказателейУсиленногоКонтроляЛабАнализом(
			Ссылка, гкс_ДокументРегистрации, гкс_НазначениеИспользованияКачества);
		гкс_ВходнойКонтрольКачества.ЗаполнитьРегистрПоказателейУсиленногоКонтроляСостояниемКачества(
			Ссылка, гкс_ДокументРегистрации);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьРегистрЗаблокированныеРегистрацииПЛК(Отказ)

	Если Отказ
		Или Не ТребуетсяЗаблокированныеТСЛабАнализа() Тогда
		Возврат;
	КонецЕсли;

	Если РазблокироватьРегистрациюНаПЛК() Тогда
		гкс_ВходнойКонтрольКачества.ОбновитьБлокировкуТекущейРегистрации(гкс_ДокументРегистрации, Ссылка);
	КонецЕсли;

КонецПроцедуры

Функция СоответствуетНормативу()

	Возврат КачественныеПоказатели.Количество() = 0
	        ИЛИ КачественныеПоказатели.НайтиСтроки(Новый Структура("СоответствуетНормативу", Ложь)).Количество() > 0;

КонецФункции

Процедура ПерезаполнитьОснованиеДвиженияЗапасовПриНеобходимости(Отказ)

	Если Отказ
		Или Не Статус = Перечисления.гкс_СтатусыЛабораторногоАнализа.Выполнен
		Или Не ЭтоПриемкаПриемкаКомпозит() Тогда

		Возврат;

	КонецЕсли;

	гкс_ПриемкаТранспорта.ПерезаполнитьОснованияПриИзмененииАнализа(Ссылка, Отказ);

КонецПроцедуры

#КонецОбласти

Процедура ИнициализироватьДопПараметры(ДопПараметры)

	ДопПараметры.ДополнительныеСвойства = Новый Структура;

	Для Каждого ДополнительноеСвойство Из ДополнительныеСвойства Цикл
		ДопПараметры.ДополнительныеСвойства.Вставить(ДополнительноеСвойство.Ключ, ДополнительноеСвойство.Значение);
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьДопПараметры(ДопПараметры, ИмяДопРеквизита, ЗначениеДопРеквизита)

	ДопПараметры.ДополнительныеСвойства.Вставить(ИмяДопРеквизита, ЗначениеДопРеквизита);
КонецПроцедуры

Процедура СформироватьНаправлениеНаРазгрузкуПриНеобходимости(ДокументРегистрации, ЛабораторныйАнализ, ДатаАнализа, ДопПараметры = Неопределено)

	Если ДопПараметры <> Неопределено И Не НазначатьНаСкладыПоПараметрам(ДопПараметры.ДополнительныеСвойства)
		Или Не гкс_ПриемкаТранспорта.НаправлятьНаРазгрузкуРазрешение(ДокументРегистрации) Тогда
		Возврат;
	КонецЕсли;

	Если РегистрацияЗаблокированаДляРазгрузки()
		Или РегистрацияНеПрошлаКомпозитНаГруппу()Тогда

		ТекстСообщения = СтрШаблон(
            	НСтр("ru='Направление на разгрузку не сформировано: регистрация %1
            	|заблокирована по усиленному контролю/ текущий промежуточный композит на группу
            	|имеет отрицательное качество'"),
				гкс_ДокументРегистрации);

		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);

		ЗаписьЖурналаРегистрации(
		            НСтр("ru='Формирование Направление на разгрузку'"), УровеньЖурналаРегистрации.Предупреждение,
			Метаданные.Документы.гкс_ЛабораторныйАнализ, ЛабораторныйАнализ, ТекстСообщения);
		Возврат;
	КонецЕсли;

	гкс_ПриемкаТранспорта.СформироватьНаправлениеНаРазгрузку(ДатаАнализа, ДокументРегистрации, ЛабораторныйАнализ);

КонецПроцедуры

Функция НазначатьНаСкладыПоПараметрам(Параметры)

	ВыполняетсяУсловие = (ТипЗнч(Параметры) = Тип("Структура"))
	        И Параметры.Свойство("НазначатьНаСклады")
	        И Параметры["НазначатьНаСклады"];

	Возврат ВыполняетсяУсловие;

КонецФункции

// Проверяет требуется ли применение усиленного контроля качества
//
// Возвращаемое значение:
//   Булево - Истина, если требуется усиленный контроль
//
Функция ТребуетсяУсиленныйКонтрольЛабАнализа()

	Возврат
		ПолучитьФункциональнуюОпцию("гкс_ИспользоватьУсиленныйКонтрольКачества")
		И Статус = Перечисления.гкс_СтатусыЛабораторногоАнализа.Выполнен
		И ЭтоПриемкаПромежуточныйКомпозит();

КонецФункции

// Проверяет требуется ли применение усиленного контроля качества
//
// Возвращаемое значение:
//   Булево - Истина, если требуется усиленный контроль
//
Функция ТребуетсяЗаблокированныеТСЛабАнализа()

	Если Не ПолучитьФункциональнуюОпцию("гкс_ИспользоватьЗаблокированныеТС") Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат
		ТребуетсяУсиленныйКонтрольЛабАнализа();

КонецФункции

Функция ЭтоРегистрацияНаПЛК(ДокументСсылка)
	Возврат
		ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.гкс_РегистрацияНаПЛК");
КонецФункции

Функция ЭтоФормированиеНомераПроб(ДокументСсылка)
	Возврат
		ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.гкс_ФормированиеНомераПробы");
КонецФункции

Процедура СформироватьВспомогательныеДанныеДляЗаблокированныхТС(Отказ)

	Если Отказ
		Или Не ТребуетсяЗаблокированныеТСЛабАнализа() Тогда
		Возврат;
	КонецЕсли;

	ДанныеДляРазгрузкиРазблокированныхТС = Новый ТаблицаЗначений;
	Если ЭтоЛабАнализДляЗаблокированныхТС() Тогда
		гкс_ВходнойКонтрольКачества.ЗаписатьСостоянияРегистрацииЗаблокированныхТС(
			Ссылка, гкс_ДокументРегистрации, ДанныеДляРазгрузкиРазблокированныхТС);
		СформироватьНаправленияНаРазгрузкуДляРазблокированныхТС(ДанныеДляРазгрузкиРазблокированныхТС);
	КонецЕсли;

	гкс_ВходнойКонтрольКачества.ЗаполнитьЗаблокированныеРегистрацииУсиленныйКонтроль(
			Ссылка, гкс_ДокументРегистрации, гкс_НазначениеИспользованияКачества);

КонецПроцедуры

Процедура СформироватьНаправленияНаРазгрузкуДляРазблокированныхТС(ДанныеДляРазгрузкиРазблокированныхТС)

	// Формируем направления для разгрузки для тех заблокированных ТС, у которых состоние регистрации = Качество принято
	Для каждого СтрокаДанные из ДанныеДляРазгрузкиРазблокированныхТС цикл

		СформироватьНаправлениеНаРазгрузкуПриНеобходимости(
			СтрокаДанные.ДокументРегистрации, СтрокаДанные.ЛабораторныйАнализ, СтрокаДанные.Дата);

	КонецЦикла;

КонецПроцедуры

Функция ЭтоЛабАнализДляЗаблокированныхТС()
	Возврат
		Перечисления.гкс_НазначенияИспользованияКачества.ЭтоПриемка(гкс_НазначениеИспользованияКачества)
		И гкс_ВходнойКонтрольКачества.ЭтоПерваяРегистрацияТСПоставщика(гкс_ДокументРегистрации)
		ИЛИ Перечисления.гкс_НазначенияИспользованияКачества.ЭтоПромежуточныйКомпозит(гкс_НазначениеИспользованияКачества)
		И ЭтоФормированиеНомераПроб(гкс_ДокументРегистрации);
КонецФункции

Функция НеОжидатьОкончанияАнализаДляВыполнения()
	Возврат ПолучитьФункциональнуюОпцию("гкс_НеОжидатьОкончанияАнализаДляВыполнения");
КонецФункции

Функция РегистрацияЗаблокированаДляРазгрузки()
	Возврат
		ТребуетсяЗаблокированныеТСЛабАнализа()
		И гкс_ВходнойКонтрольКачества.ПроверитьБлокированиеТранспортногоСредстваДляРазгрузки(
			гкс_ДокументРегистрации);
КонецФункции

Функция ЭтоПриемкаПриемкаКомпозит()

	Назначения = Новый СписокЗначений;
	Назначения.Добавить(Перечисления.гкс_НазначенияИспользованияКачества.Приемка);
	Назначения.Добавить(Перечисления.гкс_НазначенияИспользованияКачества.ПриемкаКомпозит);
	Возврат
		Назначения.НайтиПоЗначению(гкс_НазначениеИспользованияКачества) <> Неопределено;

КонецФункции

Функция ЭтоПриемкаПромежуточныйКомпозит()

	Назначения = Новый СписокЗначений;
	Назначения.Добавить(Перечисления.гкс_НазначенияИспользованияКачества.Приемка);
	Назначения.Добавить(Перечисления.гкс_НазначенияИспользованияКачества.ПромежуточныйКомпозит);
	Возврат
		Назначения.НайтиПоЗначению(гкс_НазначениеИспользованияКачества) <> Неопределено;

КонецФункции

Функция ФормироватьДополнительныеДанные()

	Возврат
	    ЗначениеЗаполнено(гкс_ДокументРегистрации)
		И ЭтоРегистрацияНаПЛК(гкс_ДокументРегистрации)
		И ЭтоПриемкаПромежуточныйКомпозит();

КонецФункции

Функция ОбновитьДаннымАРМПриемка(ДополнительныеСвойства, Отказ)

	Возврат
		Не Отказ
		И ФормироватьДополнительныеДанные()
		И ДополнительныеСвойства.Свойство("ЭтоНомерПробы");

КонецФункции

Функция ОбновитьНаправлениеНаРазгрузку(Отказ)

	Возврат
		Не Отказ
		И Статус = Перечисления.гкс_СтатусыЛабораторногоАнализа.Выполнен
		И ФормироватьДополнительныеДанные();

КонецФункции

Функция РазблокироватьРегистрациюНаПЛК()

	Возврат
		ЗначениеЗаполнено(гкс_ДокументРегистрации)
		И ЭтоРегистрацияНаПЛК(гкс_ДокументРегистрации)
		И Перечисления.
			гкс_НазначенияИспользованияКачества.ЭтоПромежуточныйКомпозит(гкс_НазначениеИспользованияКачества);

КонецФункции

Функция РегистрацияНеПрошлаКомпозитНаГруппу()
	Если Не (Статус = Перечисления.гкс_СтатусыЛабораторногоАнализа.Выполнен
		И Перечисления.гкс_НазначенияИспользованияКачества.ЭтоПриемка(гкс_НазначениеИспользованияКачества)) Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат
		гкс_ВходнойКонтрольКачества.ТекущийКомпозитныйАнализНеПройденПоКачеству(гкс_ДокументРегистрации);

КонецФункции
#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте'");
#КонецЕсли
